;;**********************************************************************
; <end_mblk.s>
;					おおしま
;	Squeakリソース終端
;	このファイルはSZABによって生成、更新されるので注意!!
;;**********************************************************************

	.file	"end_mblk.s"

;;-----------------------------------------------------------
;	section  definition
;------------------------------------------------------------

	.section	"mblk_end",.text

;------------------------------------------------------------
;	include definition
;------------------------------------------------------------

	.include	"mb.seq"
	.include	"apladr.seq"
	.include	"wtii_res.seq"

;;

 .if ROM_APPLICATION
apl_res_end:
	.data.b	BLOCK_SECTION_MARK
	.data.l	WTII_MBLOCK_NEXT	;ここは絶対に次のリソース先頭を書く！
	.data.w	0
 .endif

	.end
